### Pandas Quiz 복습

다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

```
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
```

(1) 모든 학생의 국어 점수를 시리즈로 나타낸다.

(2) 모든 학생의 수학과 영어 점수를 데이터 프레임으로 나타낸다.

(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

(4) 방자의 영어 점수를 75점으로 수정하고 평균 점수도 다시 계산한다.

(5) 몽룡의 점수를 데이터프레임으로 나타낸다.

(6) 춘향의 점수를 시리즈로 나타낸다.

In [2]:
import pandas as pd

In [3]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [4]:
df["국어"]

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

In [6]:
df[["수학", "영어"]]

    수학  영어
춘향  90  90
몽룡  60  70
향단  80  60
방자  70  40

In [7]:
df["평균"] = round(df.mean(axis = 1), 2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [8]:
df["영어"]["방자"] = 75
df["평균"] = round(df.mean(axis = 1), 2)
df

C:\Users\com\AppData\Local\Temp\ipykernel_30448\3666237047.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 75

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  75  70  55.42

In [13]:
df[1:2]

    국어  영어  수학     평균
몽룡  90  70  60  73.33

In [15]:
df.T["춘향"]

국어    80.00
영어    90.00
수학    90.00
평균    86.67
Name: 춘향, dtype: float64

### loc/iloc 복습

In [16]:
import numpy as np

In [17]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [18]:
df.loc["a"]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [19]:
df.loc["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [20]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [25]:
df.loc["a", "A"]

10

In [26]:
df.loc[["a", "c"], ["A", "D"]]

    A   D
a  10  13
c  18  21

In [27]:
df.loc[df.A > 10, ["C", "D"]]

    C   D
b  16  17
c  20  21

In [28]:
df.iloc[0, 1]

11

In [29]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int32

In [30]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [31]:
df.iloc[-1] = df.iloc[-1] * 2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42